docs(repo): migrate diagrams to Mermaid
Co-authored-by: Cody DR <dgaramos+cody@gmail.com>
